org/presentations/lisp.org
#+SETUPFILE: ~/.emacs.d/org-templates/level-1.org
#+TITLE:     Lisp (what ITA might have that we don't)

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+BEAMER_FRAME_LEVEL: 2

#+BEAMER_HEADER_EXTRA: \usetheme{Marburg}\usecolortheme{fly}
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_envargs(Env Args) %4BEAMER_col(Col) %8BEAMER_extra(Extra)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.0 :ETC

#+LATEX_HEADER: \usepackage{listings}

* Quick Overview

** History and stuff

*** One of the oldest programming languages still in use
*** Actually a family of languages
*** Academic wing (Scheme), industrial wing (Common Lisp, maybe Clojure)
*** Starting in days of limited hardware, it's quite efficient
*** Accidentally or not, raised by the Artificial Intelligence pioneers and for long time being the standard there
*** Lots of groundbreaking ideas for its time, most of them have slowly crept to mainstream and are now taken for granted (garbage collection, dynamic typing, tree data structures, interactive development)
*** Easy to implement, has standards, lots of realisations
*** Based on Alonzo Church's lambda calculus

** Common Lisp nowadays

*** Never quite in the mainstream, but with somewhat growing interest in recent years
*** Aging standard but the language doesn't feel handicapped
*** HyperSpec, excellent documentation
*** Lots of implementations, 2 of them commercial
*** The most popular open source implementation SBCL (Steel Bank Common Lisp) is actually the fastest and written in...Common Lisp
*** Small community but with increasingly better library support
*** Lots of great books
*** Known usage includes 3D graphics suits, game engines, semantic web reasoning systems, knowledge and rule based systems, theorem provers, compilers, algebra systems, telecom systems, fare search engine...

** Technical features

*** Multi-paradigm: supports procedural, functional and object-oriented styles out of the box
*** Minimal, consistent syntax based on S-expressions
