presentations/lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-30 пн 05:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lisp (what ITA might have that we don't)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Andrey Kotlarski" />
<meta name="description" content="(Common) Lisp presentation"
 />
<meta name="keywords" content="common lisp,lisp,scheme" />
<link rel="stylesheet" type="text/css" href="../css/worg-classic.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Lisp (what ITA might have that we don't)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8d54f2e">1. Quick Overview</a>
<ul>
<li><a href="#orgd3da5bf">1.1. History and stuff</a>
<ul>
<li><a href="#orgbeb8c5d">1.1.1. One of the oldest programming languages still in use</a></li>
<li><a href="#orgd2ed9b6">1.1.2. Actually a family of languages</a></li>
<li><a href="#orgee9220c">1.1.3. Academic wing (Scheme), industrial wing (Common Lisp, maybe Clojure)</a></li>
<li><a href="#org2f2ce06">1.1.4. Starting in days of limited hardware, it's quite efficient</a></li>
<li><a href="#orgdfe43bb">1.1.5. Accidentally or not, raised by the Artificial Intelligence pioneers and for long time being the standard there</a></li>
<li><a href="#org27d615f">1.1.6. Lots of groundbreaking ideas for its time, most of them have slowly crept to mainstream and are now taken for granted (garbage collection, dynamic typing, tree data structures, interactive development)</a></li>
<li><a href="#org2ff9953">1.1.7. Easy to implement, has standards, lots of realisations</a></li>
<li><a href="#org73ba666">1.1.8. Based on Alonzo Church's lambda calculus</a></li>
</ul>
</li>
<li><a href="#org32fe0ec">1.2. Common Lisp nowadays</a>
<ul>
<li><a href="#org7b30d65">1.2.1. Never quite in the mainstream, but with somewhat growing interest in recent years</a></li>
<li><a href="#org6ca9ded">1.2.2. Aging standard but the language doesn't feel handicapped</a></li>
<li><a href="#org6abf5f8">1.2.3. HyperSpec, excellent documentation</a></li>
<li><a href="#org4b09a75">1.2.4. Lots of implementations, 2 of them commercial</a></li>
<li><a href="#orgff8e351">1.2.5. The most popular open source implementation SBCL (Steel Bank Common Lisp) is actually the fastest and written in&#x2026;Common Lisp</a></li>
<li><a href="#orgd9b6a92">1.2.6. Small community but with increasingly better library support</a></li>
<li><a href="#org952085b">1.2.7. Lots of great books</a></li>
<li><a href="#org5d3de52">1.2.8. Known usage includes 3D graphics suits, game engines, semantic web reasoning systems, knowledge and rule based systems, theorem provers, compilers, algebra systems, telecom systems, fare search engine&#x2026;</a></li>
</ul>
</li>
<li><a href="#org1305eea">1.3. Technical features</a>
<ul>
<li><a href="#orgb8f5794">1.3.1. Multi-paradigm: supports procedural, functional and object-oriented styles out of the box</a></li>
<li><a href="#org3fd7752">1.3.2. Minimal, consistent syntax based on S-expressions</a></li>
<li><a href="#orge012c2a">1.3.3. Code is data</a></li>
<li><a href="#orgfbdbc19">1.3.4. Programmer has essentially everything that the language creators have had, great extensibility</a></li>
<li><a href="#orga364d70">1.3.5. Dynamic typing with optional type annotation</a></li>
<li><a href="#orgb8589cb">1.3.6. Read Eval Print Loop</a></li>
<li><a href="#orgec9b629">1.3.7. Supports incremental development</a></li>
<li><a href="#org4fc6641">1.3.8. Efficiently compiled</a></li>
<li><a href="#org6518672">1.3.9. Macros</a></li>
<li><a href="#org39d6472">1.3.10. Condition system</a></li>
<li><a href="#orgdf83586">1.3.11. CLOS</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgec04d1b">2. The Language</a>
<ul>
<li><a href="#orgcf87efa">2.1. S-expressions and evaluation</a>
<ul>
<li><a href="#org69d7732">2.1.1. S-expressions (lists) are actually the abstract syntax tree that directly feeds the lisp compiler</a></li>
<li><a href="#orgebaa1e5">2.1.2. Each S-expression returns a value</a></li>
<li><a href="#org4049486">2.1.3. Evaluating non empty list normally asks the environment for the function/macro represented by the first symbol.</a></li>
<li><a href="#org1f9bdec">2.1.4. When function, rest of the list is treated like arguments that are also evaluated and passed to the function.</a></li>
<li><a href="#org8130af4">2.1.5. When macro, rest of the list is treated like arguments that are passed as they are to the macro.</a></li>
<li><a href="#orgf8911df">2.1.6. Lists are treated as function/macro invocations unless quoted</a></li>
</ul>
</li>
<li><a href="#orgb301808">2.2. Variables</a>
<ul>
<li><a href="#orgce37cb9">2.2.1. Lexical scope by default, with a twist</a></li>
<li><a href="#orgcbb78bd">2.2.2. Closures&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></a></li>
</ul>
</li>
<li><a href="#org87441f7">2.3. Variables (continued)</a>
<ul>
<li><a href="#org3fa8ede">2.3.1. Dynamic aka special variables&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></a></li>
</ul>
</li>
<li><a href="#orgf1f0246">2.4. Functions</a>
<ul>
<li><a href="#orgaa78e56">2.4.1. First class citizens</a></li>
<li><a href="#orgb4eef6b">2.4.2. Anonymous functions</a></li>
<li><a href="#org7b2c5d2">2.4.3. Functions as data</a></li>
<li><a href="#org15507cc">2.4.4. Multiple return values</a></li>
</ul>
</li>
<li><a href="#org18af926">2.5. Macros</a>
<ul>
<li><a href="#org141c18e">2.5.1. Program life-cycle</a></li>
<li><a href="#orgfbb3b8c">2.5.2. Run-time vs. compilation</a></li>
<li><a href="#org0b0f88d">2.5.3. Macro expansion time</a></li>
<li><a href="#org733b9c3">2.5.4. Programming the compiler</a></li>
<li><a href="#orgf368ee5">2.5.5. Almost like functions on the outside</a></li>
<li><a href="#org57175e0">2.5.6. Programming over the source code with all the power of the language</a></li>
</ul>
</li>
<li><a href="#orge0d1fa2">2.6. Condition System</a>
<ul>
<li><a href="#orgb0aa48e">2.6.1. Beyond exception handling</a></li>
<li><a href="#org6fb9aba">2.6.2. Conditions and restarts</a></li>
<li><a href="#org1965b23">2.6.3. Condition handlers</a></li>
<li><a href="#org0a1dd5f">2.6.4. handler-case similar to catch&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></a></li>
</ul>
</li>
<li><a href="#orgdc6a3a7">2.7. Condition System (continued)</a>
<ul>
<li><a href="#org60519bc">2.7.1. restart-case&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></a></li>
</ul>
</li>
<li><a href="#org8a3b44f">2.8. Condition System (continued)</a>
<ul>
<li><a href="#org72a33f9">2.8.1. handler-bind&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></a></li>
<li><a href="#org33f649f">2.8.2. Signals, why just errors</a></li>
<li><a href="#orgf9fe9ee">2.8.3. Restarts at lower levels, handlers at higher</a></li>
</ul>
</li>
<li><a href="#org5ded1c4">2.9. Common Lisp Object System</a>
<ul>
<li><a href="#orgc2bd4c8">2.9.1. Message passing</a></li>
<li><a href="#org1af090d">2.9.2. Decoupling classes from methods</a></li>
<li><a href="#orgdae391b">2.9.3. Generic functions</a></li>
<li><a href="#org2258d56">2.9.4. Method combinations</a></li>
<li><a href="#org3451bef">2.9.5. Multimethods</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga1ca379">3. A bit of code</a>
<ul>
<li><a href="#orgadc579f">3.1. Switch to Emacs please</a></li>
</ul>
</li>
<li><a href="#org5402b79">4. Resources</a>
<ul>
<li><a href="#org6d6dd34">4.1. Books</a>
<ul>
<li><a href="#org255280d">4.1.1. Practical Common Lisp</a></li>
<li><a href="#org66c0164">4.1.2. HyperSpec</a></li>
<li><a href="#orgb58f01a">4.1.3. Common Lisp the Language, 2nd Edition</a></li>
<li><a href="#org6fcdb0a">4.1.4. On Lisp: Advanced Techniques for Common Lisp</a></li>
<li><a href="#org722af98">4.1.5. Common Lisp: A Gentle Introduction to Symbolic Computation</a></li>
<li><a href="#orgd9c44cb">4.1.6. Paradigms of Artificial Intelligence Programming</a></li>
<li><a href="#org491325b">4.1.7. Structure and Interpretation of Computer Programs</a></li>
</ul>
</li>
<li><a href="#org9afb68d">4.2. Links</a>
<ul>
<li><a href="#org9fd7c09">4.2.1. CLiki</a></li>
<li><a href="#org7169507">4.2.2. CL resources</a></li>
<li><a href="#org0bc5e53">4.2.3. Implementations: A Survey</a></li>
<li><a href="#org83b4a72">4.2.4. Quicklisp - CL package manager</a></li>
<li><a href="#org4a67763">4.2.5. SLIME: The Superior Lisp Interaction Mode for Emacs</a></li>
<li><a href="#orga619c58">4.2.6. Dr. Edmund Weitz's great libraries</a></li>
<li><a href="#orgfef0cd2">4.2.7. Steel Bank Common Lisp</a></li>
<li><a href="#orgf128727">4.2.8. Some SBCL benchmarks</a></li>
<li><a href="#org8aea31a">4.2.9. Franz Inc.</a></li>
<li><a href="#org67fe74b">4.2.10. LispWorks</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org419b352">5. Fun</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8d54f2e" class="outline-2">
<h2 id="org8d54f2e"><span class="section-number-2">1</span> Quick Overview</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd3da5bf" class="outline-3">
<h3 id="orgd3da5bf"><span class="section-number-3">1.1</span> History and stuff</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgbeb8c5d" class="outline-4">
<h4 id="orgbeb8c5d"><span class="section-number-4">1.1.1</span> One of the oldest programming languages still in use</h4>
</div>
<div id="outline-container-orgd2ed9b6" class="outline-4">
<h4 id="orgd2ed9b6"><span class="section-number-4">1.1.2</span> Actually a family of languages</h4>
</div>
<div id="outline-container-orgee9220c" class="outline-4">
<h4 id="orgee9220c"><span class="section-number-4">1.1.3</span> Academic wing (Scheme), industrial wing (Common Lisp, maybe Clojure)</h4>
</div>
<div id="outline-container-org2f2ce06" class="outline-4">
<h4 id="org2f2ce06"><span class="section-number-4">1.1.4</span> Starting in days of limited hardware, it's quite efficient</h4>
</div>
<div id="outline-container-orgdfe43bb" class="outline-4">
<h4 id="orgdfe43bb"><span class="section-number-4">1.1.5</span> Accidentally or not, raised by the Artificial Intelligence pioneers and for long time being the standard there</h4>
</div>
<div id="outline-container-org27d615f" class="outline-4">
<h4 id="org27d615f"><span class="section-number-4">1.1.6</span> Lots of groundbreaking ideas for its time, most of them have slowly crept to mainstream and are now taken for granted (garbage collection, dynamic typing, tree data structures, interactive development)</h4>
</div>
<div id="outline-container-org2ff9953" class="outline-4">
<h4 id="org2ff9953"><span class="section-number-4">1.1.7</span> Easy to implement, has standards, lots of realisations</h4>
</div>
<div id="outline-container-org73ba666" class="outline-4">
<h4 id="org73ba666"><span class="section-number-4">1.1.8</span> Based on Alonzo Church's lambda calculus</h4>
</div>
</div>

<div id="outline-container-org32fe0ec" class="outline-3">
<h3 id="org32fe0ec"><span class="section-number-3">1.2</span> Common Lisp nowadays</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org7b30d65" class="outline-4">
<h4 id="org7b30d65"><span class="section-number-4">1.2.1</span> Never quite in the mainstream, but with somewhat growing interest in recent years</h4>
</div>
<div id="outline-container-org6ca9ded" class="outline-4">
<h4 id="org6ca9ded"><span class="section-number-4">1.2.2</span> Aging standard but the language doesn't feel handicapped</h4>
</div>
<div id="outline-container-org6abf5f8" class="outline-4">
<h4 id="org6abf5f8"><span class="section-number-4">1.2.3</span> HyperSpec, excellent documentation</h4>
</div>
<div id="outline-container-org4b09a75" class="outline-4">
<h4 id="org4b09a75"><span class="section-number-4">1.2.4</span> Lots of implementations, 2 of them commercial</h4>
</div>
<div id="outline-container-orgff8e351" class="outline-4">
<h4 id="orgff8e351"><span class="section-number-4">1.2.5</span> The most popular open source implementation SBCL (Steel Bank Common Lisp) is actually the fastest and written in&#x2026;Common Lisp</h4>
</div>
<div id="outline-container-orgd9b6a92" class="outline-4">
<h4 id="orgd9b6a92"><span class="section-number-4">1.2.6</span> Small community but with increasingly better library support</h4>
</div>
<div id="outline-container-org952085b" class="outline-4">
<h4 id="org952085b"><span class="section-number-4">1.2.7</span> Lots of great books</h4>
</div>
<div id="outline-container-org5d3de52" class="outline-4">
<h4 id="org5d3de52"><span class="section-number-4">1.2.8</span> Known usage includes 3D graphics suits, game engines, semantic web reasoning systems, knowledge and rule based systems, theorem provers, compilers, algebra systems, telecom systems, fare search engine&#x2026;</h4>
</div>
</div>

<div id="outline-container-org1305eea" class="outline-3">
<h3 id="org1305eea"><span class="section-number-3">1.3</span> Technical features</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgb8f5794" class="outline-4">
<h4 id="orgb8f5794"><span class="section-number-4">1.3.1</span> Multi-paradigm: supports procedural, functional and object-oriented styles out of the box</h4>
</div>
<div id="outline-container-org3fd7752" class="outline-4">
<h4 id="org3fd7752"><span class="section-number-4">1.3.2</span> Minimal, consistent syntax based on S-expressions</h4>
</div>
