org/presentations/lisp.org
*** Code is data
*** Programmer has essentially everything that the language creators have had, great extensibility
*** Dynamic typing with optional type annotation
*** Read Eval Print Loop
*** Supports incremental development
*** Efficiently compiled
*** Macros
*** Condition system
*** CLOS

* The Language

** S-expressions and evaluation

*** S-expressions (lists) are actually the abstract syntax tree that directly feeds the lisp compiler
*** Each S-expression returns a value
*** Evaluating non empty list normally asks the environment for the function/macro represented by the first symbol.
*** When function, rest of the list is treated like arguments that are also evaluated and passed to the function.

#+begin_src common-lisp
(some-function arguments that are first evaluated)
#+end_src

*** When macro, rest of the list is treated like arguments that are passed as they are to the macro.

#+begin_src common-lisp
(some-macro arguments passed as they are)
#+end_src

*** Lists are treated as function/macro invocations unless quoted

#+begin_src common-lisp
'(some list with unevaluated elements)
#+end_src

** Variables

*** Lexical scope by default, with a twist
*** Closures							  :B_example:
    :PROPERTIES:
    :BEAMER_env: example
    :END:

#+BEGIN_SRC lisp
(let ((counter 0))
  (defun inc-counter ()
    (incf counter))

  (defun dec-counter ()
    (decf counter)))
#+END_SRC

** Variables (continued)

*** Dynamic aka special variables 				  :B_example:
    :PROPERTIES:
    :BEAMER_env: example
    :END:

#+BEGIN_SRC lisp
(defparameter *debug* nil)

(defun bla-bla ()
  (no-debugging)
  (let ((*debug* t))
    (do-some-stuff-with-debugging))
  (no-debugging))
#+END_SRC

** Functions

*** First class citizens
*** Anonymous functions
*** Functions as data
*** Multiple return values

** Macros

*** Program life-cycle
*** Run-time vs. compilation
*** Macro expansion time
*** Programming the compiler
*** Almost like functions on the outside
*** Programming over the source code with all the power of the language

** Condition System

*** Beyond exception handling
*** Conditions and restarts
*** Condition handlers
*** handler-case similar to catch 				  :B_example:
    :PROPERTIES:
    :BEAMER_env: example
    :END:

#+BEGIN_SRC lisp
(handler-case
    (progn
      (do-stuff)
      (do-more-stuff))
  (some-exception (se) (recover se)))
#+END_SRC

\hfill \(\qed\)

** Condition System (continued)

*** restart-case 						  :B_example:
    :PROPERTIES:
    :BEAMER_env: example
    :END:

#+BEGIN_SRC lisp
(defun parse-log-file (file)
  (with-open-file (in file :direction :input)
    (loop for text = (read-line in nil nil)
	  while text
	  for entry = (restart-case
			  (parse-log-entry text)
			(skip-log-entry () nil))
	  when entry collect it)))
#+END_SRC

** Condition System (continued)

*** handler-bind 						  :B_example:
    :PROPERTIES:
    :BEAMER_env: example
    :END:

#+BEGIN_SRC lisp
(defun log-analyzer ()
  (handler-bind
      ((malformed-log-entry-error
	 #'(lambda (c)
	     (invoke-restart'skip-log-entry))))
    (dolist (log (find-all-logs))
      (analyze-log log))))
#+END_SRC

*** Signals, why just errors
*** Restarts at lower levels, handlers at higher

** Common Lisp Object System

*** Message passing
*** Decoupling classes from methods
*** Generic functions
*** Method combinations
*** Multimethods

* A bit of code

