presentations/lisp.html
<div id="outline-container-orge012c2a" class="outline-4">
<h4 id="orge012c2a"><span class="section-number-4">1.3.3</span> Code is data</h4>
</div>
<div id="outline-container-orgfbdbc19" class="outline-4">
<h4 id="orgfbdbc19"><span class="section-number-4">1.3.4</span> Programmer has essentially everything that the language creators have had, great extensibility</h4>
</div>
<div id="outline-container-orga364d70" class="outline-4">
<h4 id="orga364d70"><span class="section-number-4">1.3.5</span> Dynamic typing with optional type annotation</h4>
</div>
<div id="outline-container-orgb8589cb" class="outline-4">
<h4 id="orgb8589cb"><span class="section-number-4">1.3.6</span> Read Eval Print Loop</h4>
</div>
<div id="outline-container-orgec9b629" class="outline-4">
<h4 id="orgec9b629"><span class="section-number-4">1.3.7</span> Supports incremental development</h4>
</div>
<div id="outline-container-org4fc6641" class="outline-4">
<h4 id="org4fc6641"><span class="section-number-4">1.3.8</span> Efficiently compiled</h4>
</div>
<div id="outline-container-org6518672" class="outline-4">
<h4 id="org6518672"><span class="section-number-4">1.3.9</span> Macros</h4>
</div>
<div id="outline-container-org39d6472" class="outline-4">
<h4 id="org39d6472"><span class="section-number-4">1.3.10</span> Condition system</h4>
</div>
<div id="outline-container-orgdf83586" class="outline-4">
<h4 id="orgdf83586"><span class="section-number-4">1.3.11</span> CLOS</h4>
</div>
</div>
</div>

<div id="outline-container-orgec04d1b" class="outline-2">
<h2 id="orgec04d1b"><span class="section-number-2">2</span> The Language</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcf87efa" class="outline-3">
<h3 id="orgcf87efa"><span class="section-number-3">2.1</span> S-expressions and evaluation</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org69d7732" class="outline-4">
<h4 id="org69d7732"><span class="section-number-4">2.1.1</span> S-expressions (lists) are actually the abstract syntax tree that directly feeds the lisp compiler</h4>
</div>
<div id="outline-container-orgebaa1e5" class="outline-4">
<h4 id="orgebaa1e5"><span class="section-number-4">2.1.2</span> Each S-expression returns a value</h4>
</div>
<div id="outline-container-org4049486" class="outline-4">
<h4 id="org4049486"><span class="section-number-4">2.1.3</span> Evaluating non empty list normally asks the environment for the function/macro represented by the first symbol.</h4>
</div>
<div id="outline-container-org1f9bdec" class="outline-4">
<h4 id="org1f9bdec"><span class="section-number-4">2.1.4</span> When function, rest of the list is treated like arguments that are also evaluated and passed to the function.</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-common-lisp">(some-function arguments that are first evaluated)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8130af4" class="outline-4">
<h4 id="org8130af4"><span class="section-number-4">2.1.5</span> When macro, rest of the list is treated like arguments that are passed as they are to the macro.</h4>
<div class="outline-text-4" id="text-2-1-5">
<div class="org-src-container">
<pre class="src src-common-lisp">(some-macro arguments passed as they are)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8911df" class="outline-4">
<h4 id="orgf8911df"><span class="section-number-4">2.1.6</span> Lists are treated as function/macro invocations unless quoted</h4>
<div class="outline-text-4" id="text-2-1-6">
<div class="org-src-container">
<pre class="src src-common-lisp">'(some list with unevaluated elements)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb301808" class="outline-3">
<h3 id="orgb301808"><span class="section-number-3">2.2</span> Variables</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgce37cb9" class="outline-4">
<h4 id="orgce37cb9"><span class="section-number-4">2.2.1</span> Lexical scope by default, with a twist</h4>
</div>
<div id="outline-container-orgcbb78bd" class="outline-4">
<h4 id="orgcbb78bd"><span class="section-number-4">2.2.2</span> Closures&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #8ac6f2; font-weight: bold;">let</span> ((counter 0))
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">inc-counter</span> ()
    (incf counter))

  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">dec-counter</span> ()
    (decf counter)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org87441f7" class="outline-3">
<h3 id="org87441f7"><span class="section-number-3">2.3</span> Variables (continued)</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org3fa8ede" class="outline-4">
<h4 id="org3fa8ede"><span class="section-number-4">2.3.1</span> Dynamic aka special variables&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defparameter</span> <span style="color: #cae682;">*debug*</span> nil)

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">bla-bla</span> ()
  (no-debugging)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((*debug* t))
    (do-some-stuff-with-debugging))
  (no-debugging))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf1f0246" class="outline-3">
<h3 id="orgf1f0246"><span class="section-number-3">2.4</span> Functions</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orgaa78e56" class="outline-4">
<h4 id="orgaa78e56"><span class="section-number-4">2.4.1</span> First class citizens</h4>
</div>
<div id="outline-container-orgb4eef6b" class="outline-4">
<h4 id="orgb4eef6b"><span class="section-number-4">2.4.2</span> Anonymous functions</h4>
</div>
<div id="outline-container-org7b2c5d2" class="outline-4">
<h4 id="org7b2c5d2"><span class="section-number-4">2.4.3</span> Functions as data</h4>
</div>
<div id="outline-container-org15507cc" class="outline-4">
<h4 id="org15507cc"><span class="section-number-4">2.4.4</span> Multiple return values</h4>
</div>
</div>

<div id="outline-container-org18af926" class="outline-3">
<h3 id="org18af926"><span class="section-number-3">2.5</span> Macros</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org141c18e" class="outline-4">
<h4 id="org141c18e"><span class="section-number-4">2.5.1</span> Program life-cycle</h4>
</div>
<div id="outline-container-orgfbb3b8c" class="outline-4">
<h4 id="orgfbb3b8c"><span class="section-number-4">2.5.2</span> Run-time vs. compilation</h4>
</div>
<div id="outline-container-org0b0f88d" class="outline-4">
<h4 id="org0b0f88d"><span class="section-number-4">2.5.3</span> Macro expansion time</h4>
</div>
<div id="outline-container-org733b9c3" class="outline-4">
<h4 id="org733b9c3"><span class="section-number-4">2.5.4</span> Programming the compiler</h4>
</div>
<div id="outline-container-orgf368ee5" class="outline-4">
<h4 id="orgf368ee5"><span class="section-number-4">2.5.5</span> Almost like functions on the outside</h4>
</div>
<div id="outline-container-org57175e0" class="outline-4">
<h4 id="org57175e0"><span class="section-number-4">2.5.6</span> Programming over the source code with all the power of the language</h4>
</div>
</div>

<div id="outline-container-orge0d1fa2" class="outline-3">
<h3 id="orge0d1fa2"><span class="section-number-3">2.6</span> Condition System</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-orgb0aa48e" class="outline-4">
<h4 id="orgb0aa48e"><span class="section-number-4">2.6.1</span> Beyond exception handling</h4>
</div>
<div id="outline-container-org6fb9aba" class="outline-4">
<h4 id="org6fb9aba"><span class="section-number-4">2.6.2</span> Conditions and restarts</h4>
</div>
<div id="outline-container-org1965b23" class="outline-4">
<h4 id="org1965b23"><span class="section-number-4">2.6.3</span> Condition handlers</h4>
</div>
<div id="outline-container-org0a1dd5f" class="outline-4">
<h4 id="org0a1dd5f"><span class="section-number-4">2.6.4</span> handler-case similar to catch&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></h4>
<div class="outline-text-4" id="text-2-6-4">
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #8ac6f2; font-weight: bold;">handler-case</span>
    (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
      (do-stuff)
      (do-more-stuff))
  (some-exception (se) (recover se)))
</pre>
</div>

<p>
\hfill \(\qed\)
</p>
</div>
</div>
</div>

<div id="outline-container-orgdc6a3a7" class="outline-3">
<h3 id="orgdc6a3a7"><span class="section-number-3">2.7</span> Condition System (continued)</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org60519bc" class="outline-4">
<h4 id="org60519bc"><span class="section-number-4">2.7.1</span> restart-case&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></h4>
<div class="outline-text-4" id="text-2-7-1">
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">parse-log-file</span> (file)
  (<span style="color: #8ac6f2; font-weight: bold;">with-open-file</span> (in file <span style="color: #e5786d;">:direction</span> <span style="color: #e5786d;">:input</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">loop</span> for text = (read-line in nil nil)
          while text
          for entry = (<span style="color: #8ac6f2; font-weight: bold;">restart-case</span>
                          (parse-log-entry text)
                        (skip-log-entry () nil))
          when entry collect it)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8a3b44f" class="outline-3">
<h3 id="org8a3b44f"><span class="section-number-3">2.8</span> Condition System (continued)</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-org72a33f9" class="outline-4">
<h4 id="org72a33f9"><span class="section-number-4">2.8.1</span> handler-bind&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span></h4>
<div class="outline-text-4" id="text-2-8-1">
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">log-analyzer</span> ()
  (<span style="color: #8ac6f2; font-weight: bold;">handler-bind</span>
      ((malformed-log-entry-error
         #'(<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (c)
             (invoke-restart'skip-log-entry))))
    (<span style="color: #8ac6f2; font-weight: bold;">dolist</span> (log (find-all-logs))
      (analyze-log log))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org33f649f" class="outline-4">
<h4 id="org33f649f"><span class="section-number-4">2.8.2</span> Signals, why just errors</h4>
</div>
<div id="outline-container-orgf9fe9ee" class="outline-4">
<h4 id="orgf9fe9ee"><span class="section-number-4">2.8.3</span> Restarts at lower levels, handlers at higher</h4>
</div>
</div>

<div id="outline-container-org5ded1c4" class="outline-3">
<h3 id="org5ded1c4"><span class="section-number-3">2.9</span> Common Lisp Object System</h3>
<div class="outline-text-3" id="text-2-9">
</div>
<div id="outline-container-orgc2bd4c8" class="outline-4">
<h4 id="orgc2bd4c8"><span class="section-number-4">2.9.1</span> Message passing</h4>
</div>
<div id="outline-container-org1af090d" class="outline-4">
<h4 id="org1af090d"><span class="section-number-4">2.9.2</span> Decoupling classes from methods</h4>
</div>
<div id="outline-container-orgdae391b" class="outline-4">
<h4 id="orgdae391b"><span class="section-number-4">2.9.3</span> Generic functions</h4>
</div>
<div id="outline-container-org2258d56" class="outline-4">
<h4 id="org2258d56"><span class="section-number-4">2.9.4</span> Method combinations</h4>
</div>
